| Topic | Description |
| ----------- | ----------- |
| [Series](#Series) | Series is a one-dimensional labeled array capable of holding any data type (integer, string, float, etc.). It is similar to a column in a spreadsheet or a simple data structure like a list or an array |
| [Labels](#Labels) | Label refers to the unique identifier associated with each element in a Series or DataFrame. It acts as an index or key that allows for easy identification and retrieval of specific data points. |
| [key:Value Objects as Series](#Value-Objects-as-Series) | Converting python dictionaries from python into pandas data frames |
| [Pandas Data Frame](#Pandas-Data-Frame) | Learn to convert dictionaries that include a key as the label, and array stored as the values to create a pandas DataFrame |
| [Locate Row](#Locate-Row) | Learn to call the loc method to retrieve rows bases on indices |
| [Locate Named Indexes](#Locate-Named-Indexes) | Learn how to create use the loc method to retrieve rows using named indices |
| [Read CSV Files](#Read-CSV-Files) | Learn how to load in CSV files as a pandas Data Frame |
| [Head Method](#Head-Method) | Learn how to use the head function to retrieve a sample size of a larger data set |
| [Viewing All Data](#Viewing-All-Data-Using-to_string()) | using to_string method to output the entirety as a data set |
| [Cleaning data](#Dealing-With-Empty-Cells) | useful functions and methods to clean data
| [Returning Column labels](#Retrieving-Column-Names) | retrieve just column labels |
| [Changing Column labels](#Changing-Column-labels) | Changing Column labels|

In [2]:
import pandas as pd

#### Series
A series a column in a table. It is a one dimensional array holding any type of data

In [3]:
# Here we create an array myList, then pass it through Series function from pandas create a series that also includes a an index 
myList = [1,6,4]
mySeries = pd.Series(myList)
mySeries

0    1
1    6
2    4
dtype: int64

#### Labels

In [4]:
# notice how we can retrieve an element from the series by calling its index
mySeries[1]

6

In [5]:
# In this program instead of retrieving and element from series using the index, we are going to assign labels to the values then retrieve the data
mySeries2 = pd.Series([1,4,2,], index = ["x","y","z"])
mySeries2

x    1
y    4
z    2
dtype: int64

In [6]:
# Now we can access them using a the label name
mySeries2["y"]

4

#### key:Value-Objects-as-Series

In [7]:
# we can use dictionaries to create series and in this case the keys become the labels
myDict = {"dog1":"Lyra", "dog2":"Jayce", "dog3":"Jodi", "dog4":"Ellie"} 
mySeries3 = pd.Series(myDict, index=["dog1", "dog2","dog3"]) # notice how we can select which key/pair values we want to be apart of our new series

print(f'This is our dictionary turned in a pandas series \n{mySeries3}')

This is our dictionary turned in a pandas series
dog1     Lyra
dog2    Jayce
dog3     Jodi
dtype: object

In [8]:
# We can also now retrieve a value from our series using a the dictionary key which is now the label
mySeries3['dog3']

'Jodi'

#### Pandas-Data-Frame

In [ ]:
# A pandas data frame is a two dimensional structure

In [9]:
# here we use a python dictionary where the keys are our labels and the values are arrays holding our column values. We pass the 'data' object through the DataFrame function
data = {
    "calories":[433,554,634,154],
    "duration":[10,12,17,3],
    "pulse":[110,134,166,87]
}

dataFrame = pd.DataFrame(data)
dataFrame

   calories  duration  pulse
0       433        10    110
1       554        12    134
2       634        17    166
3       154         3     87

#### Locate-Row

In [ ]:
# To locate a row from a pandas data frame using the Index value we can call the loc method
dataFrame.loc[0]

In [ ]:
# If you want the output to also be in the pandas data frame format you can use two brackets
dataFrame.loc[[0,2]] # you can also now pass multiple indices

#### Locate-Named-Indexes

In [ ]:
data2 = {
    "calories":[433,554,634,154],
    "duration":[10,12,17,3],
    "pulse":[110,134,166,87]
}
df = pd.DataFrame(data2, index=['day1', 'day2', 'day3', 'day4'])
df

In [ ]:
df.loc[['day2']]

#### Read-CSV-Files

In [10]:
# Loading a csv file
df2 = pd.read_csv('kaggleTitanicTestDataSet.csv')
df2

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

##### Reading in a csv file using a url link

In [11]:
df3 = pd.read_csv('https://raw.githubusercontent.com/pplonski/datasets-for-start/master/adult/data.csv', skipinitialspace=True) # you can pass the skipinitialspace argument to remove any unnecessary blank spaces.
df3

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

#### Head-Method

In [ ]:
numberOfRows = input("how many rows would you like you like to view?: ")
df2.head(int(numberOfRows))

#### Viewing-All-Data-Using-to_string()

In [ ]:
print(df2.to_string())

### Cleaning Data

#### Dealing-With-Empty-Cells

In [ ]:
df2.dropna(inplace=True) # the dropna method finds and removes all the empty cells and passing inplace=True applies changes to the original data frame. this way you dont have to assign the line of code to a new variable.

#### Retrieving-Column-Names

In [33]:
#columnLabels = df2.columns
#columnLabels

# This is an example of using list comprehension to for loop through the labels and removing the labels 'Fare','Ticket','Sex'
x_cols = [i for i in df2.columns if i not in ['Fare','Ticket','Sex']]
x_cols

['PassengerId', 'Pclass', 'Name', 'Age', 'SibSp', 'Parch', 'Cabin', 'Embarked']

#### Changing-Column-labels

In [16]:
# Here we use a url to download a dataset. We change the original names to something bogus in an array and assign it to a variable, then set name= colnames
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/blood-transfusion/transfusion.data'
colNames = ['Recency (months)','Frequency (times)','Monetary','Time (years)','whether he/she donated blood in March 2048']
pd.read_csv(url, names=colNames)

,Recency (months),Frequency (times),Monetary,Time (years),whether he/she donated blood in March 2048
0,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
1,2,50,12500,98,1
2,0,13,3250,28,1
3,1,16,4000,35,1
4,2,20,5000,45,1
...,...,...,...,...,...
744,23,2,500,38,0
745,21,2,500,52,0
746,23,3,750,62,0
747,39,1,250,39,0
748,72,1,250,72,0